       01  INPUT-RECORD.
           05 IN-CUSTOMER-NUM          PIC X(10).
           05 IN-POLICY-TYPE           PIC X(1).
           05 IN-PROPERTY-TYPE         PIC X(15).
           05 IN-POSTCODE              PIC X(8).
           05 IN-ADDRESS               PIC X(60).
           05 IN-LATITUDE              PIC X(15).
           05 IN-LONGITUDE             PIC X(15).
           05 IN-CUSTOMER-NAME         PIC X(50).
           05 IN-FIRE-PERIL            PIC 9(4).
           05 IN-CRIME-PERIL           PIC 9(4).
           05 IN-FLOOD-PERIL           PIC 9(4).
           05 IN-WEATHER-PERIL         PIC 9(4).
           05 FILLER                   PIC X(10). 